import spacy

# Загрузка модели языка
nlp = spacy.load("en_core_web_sm")

def _list_sentensis(text):
    # Обработка текста с помощью spaCy
    doc = nlp(text)

    # Извлечение ключевых фраз
    key_phrases = []

    # Цикл по предложениям для поиска ключевой информации
    for sentence in doc.sents:
        for token in sentence:
            if token.text.lower() in ["внешне", "внешний вид","волосы","волос", "волосами", "рост","ростом","роста",
                                      "кожа","кожей", "глаза", "глаз", "глазом","глазами", "лицо", "лица", "лицами",
                                      "конечности", "конечностей", "конечностями", "руки", "рук", "руками", "нога", "ноги",
                                      "ног", "ногами", "когти", "когтей", "крылья", "крыло", "крыльев", "одежда", "одежды",
                                      "носит","несет","одет","надето","держит","окрас","окраса","окрашен", "цвет", "цвета",
                                      "шапк", "хвост", "нос", "губ", "шея", "шеи", "пальцы", "палец", "пальцев", "мужчина", "мальчик",
                                      "юноша", "подросток", "дед", "самец", "самка", "женщина", "девушка", "девочка", "бабушка",
                                      "пузо", "живот", "национальность", "национальности", "на голове", " на теле", "ходит в",
                                      "футболка", "футболки", "рубашка", "рубашки", "блузка", "блузки", "поло", "толстовка",
                                      "толстовки", "свитер", "свитера", "кардиган", "кардигана", "жакет", "жакета", "пиджак",
                                      "пиджака", "пальто", "джинсы", "джинсов", "брюки", "брюк", "шорты", "шортов",
                                      "юбка", "юбки", "платье", "платья", "костюм", "костюма", "комбинезон", "комбинезона",
                                      "халат", "халата", "куртка", "куртки", "плащ", "плаща", "ветровка", "ветровки",
                                      "парка", "парки", "дождевик", "дождевика", "туника", "туники", "леггинсы", "леггинсов",
                                      "колготки", "колготок", "чулки", "чулок", "носки", "носков", "туфли", "туфель", "ботинки",
                                      "ботинок", "сапоги", "сапог", "кроссовки", "кроссовок", "сандалии", "сандалей", "тапочки",
                                      "тапочек", "пояс", "пояса", "шарф", "шарфа", "платок", "платка", "галстук", "галстука",
                                      "галстук-бабочка", "галстука-бабочки", "перчатки", "перчаток", "шапка", "шапки", "берет",
                                      "берета", "панама", "панамы", "кепка", "кепки", "шляпа", "шляпы", "фуражка", "фуражки",
                                      "жилет", "жилета", "корсет", "корсета", "майка", "майки", "бикини","Красный", "Красная",
                                      "Красные", "Красные", "Зелёный", "Зелёная", "Зелёные", "Зелёные", "Синий", "Синяя", "Синие",
                                      "Синие", "Жёлтый", "Жёлтая", "Жёлтые", "Жёлтые", "Чёрный", "Чёрная", "Чёрные", "Чёрные",
                                      "Белый", "Белая", "Белые", "Белые", "Фиолетовый", "Фиолетовая", "Фиолетовые", "Фиолетовые",
                                      "Оранжевый", "Оранжевая", "Оранжевые", "Оранжевые", "Розовый", "Розовая", "Розовые", "Розовые",
                                      "Голубой", "Голубая", "Голубые", "Голубые", "Коричневый", "Коричневая", "Коричневые", "Коричневые",
                                      "Серый", "Серая", "Серые", "Серые", "Бежевый", "Бежевая", "Бежевые", "Бежевые", "Бирюзовый",
                                      "Бирюзовая", "Бирюзовые", "Бирюзовые"]:
                key_phrases.append(sentence.text)

    # Удаление всех пустых строк
    key_phrases = list(filter(None, key_phrases))

    # Удаление повторяющихся фраз
    key_phrases = list(set(key_phrases))

    # Преобразование множества обратно в список
    key_phrases = list(key_phrases)

    # Возвращаем результат в виде ключевых фраз
    return key_phrases
